espressif/esp-idf/components/soc/esp32s2/register/soc/rtc_i2c_reg.h
#define RTC_I2C_CMD0_REG          (DR_REG_RTC_I2C_BASE + 0x0038)
/* RTC_I2C_COMMAND0_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command0_done*/
#define RTC_I2C_COMMAND0_DONE  (BIT(31))
#define RTC_I2C_COMMAND0_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND0_DONE_V  0x1
#define RTC_I2C_COMMAND0_DONE_S  31
/* RTC_I2C_COMMAND0 : R/W ;bitpos:[13:0] ;default: 14'h0903 ; */
/*description: command0*/
#define RTC_I2C_COMMAND0  0x00003FFF
#define RTC_I2C_COMMAND0_M  ((RTC_I2C_COMMAND0_V)<<(RTC_I2C_COMMAND0_S))
#define RTC_I2C_COMMAND0_V  0x3FFF
#define RTC_I2C_COMMAND0_S  0

#define RTC_I2C_CMD1_REG          (DR_REG_RTC_I2C_BASE + 0x003c)
/* RTC_I2C_COMMAND1_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command1_done*/
#define RTC_I2C_COMMAND1_DONE  (BIT(31))
#define RTC_I2C_COMMAND1_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND1_DONE_V  0x1
#define RTC_I2C_COMMAND1_DONE_S  31
/* RTC_I2C_COMMAND1 : R/W ;bitpos:[13:0] ;default: 14'h1901 ; */
/*description: command1*/
#define RTC_I2C_COMMAND1  0x00003FFF
#define RTC_I2C_COMMAND1_M  ((RTC_I2C_COMMAND1_V)<<(RTC_I2C_COMMAND1_S))
#define RTC_I2C_COMMAND1_V  0x3FFF
#define RTC_I2C_COMMAND1_S  0

#define RTC_I2C_CMD2_REG          (DR_REG_RTC_I2C_BASE + 0x0040)
/* RTC_I2C_COMMAND2_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command2_done*/
#define RTC_I2C_COMMAND2_DONE  (BIT(31))
#define RTC_I2C_COMMAND2_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND2_DONE_V  0x1
#define RTC_I2C_COMMAND2_DONE_S  31
/* RTC_I2C_COMMAND2 : R/W ;bitpos:[13:0] ;default: 14'h0902 ; */
/*description: command2*/
#define RTC_I2C_COMMAND2  0x00003FFF
#define RTC_I2C_COMMAND2_M  ((RTC_I2C_COMMAND2_V)<<(RTC_I2C_COMMAND2_S))
#define RTC_I2C_COMMAND2_V  0x3FFF
#define RTC_I2C_COMMAND2_S  0

#define RTC_I2C_CMD3_REG          (DR_REG_RTC_I2C_BASE + 0x0044)
/* RTC_I2C_COMMAND3_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command3_done*/
#define RTC_I2C_COMMAND3_DONE  (BIT(31))
#define RTC_I2C_COMMAND3_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND3_DONE_V  0x1
#define RTC_I2C_COMMAND3_DONE_S  31
/* RTC_I2C_COMMAND3 : R/W ;bitpos:[13:0] ;default: 14'h0101 ; */
/*description: command3*/
#define RTC_I2C_COMMAND3  0x00003FFF
#define RTC_I2C_COMMAND3_M  ((RTC_I2C_COMMAND3_V)<<(RTC_I2C_COMMAND3_S))
#define RTC_I2C_COMMAND3_V  0x3FFF
#define RTC_I2C_COMMAND3_S  0

#define RTC_I2C_CMD4_REG          (DR_REG_RTC_I2C_BASE + 0x0048)
/* RTC_I2C_COMMAND4_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command4_done*/
#define RTC_I2C_COMMAND4_DONE  (BIT(31))
#define RTC_I2C_COMMAND4_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND4_DONE_V  0x1
#define RTC_I2C_COMMAND4_DONE_S  31
/* RTC_I2C_COMMAND4 : R/W ;bitpos:[13:0] ;default: 14'h0901 ; */
/*description: command4*/
#define RTC_I2C_COMMAND4  0x00003FFF
#define RTC_I2C_COMMAND4_M  ((RTC_I2C_COMMAND4_V)<<(RTC_I2C_COMMAND4_S))
#define RTC_I2C_COMMAND4_V  0x3FFF
#define RTC_I2C_COMMAND4_S  0

#define RTC_I2C_CMD5_REG          (DR_REG_RTC_I2C_BASE + 0x004c)
/* RTC_I2C_COMMAND5_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command5_done*/
#define RTC_I2C_COMMAND5_DONE  (BIT(31))
#define RTC_I2C_COMMAND5_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND5_DONE_V  0x1
#define RTC_I2C_COMMAND5_DONE_S  31
/* RTC_I2C_COMMAND5 : R/W ;bitpos:[13:0] ;default: 14'h1701 ; */
/*description: command5*/
#define RTC_I2C_COMMAND5  0x00003FFF
#define RTC_I2C_COMMAND5_M  ((RTC_I2C_COMMAND5_V)<<(RTC_I2C_COMMAND5_S))
#define RTC_I2C_COMMAND5_V  0x3FFF
#define RTC_I2C_COMMAND5_S  0

#define RTC_I2C_CMD6_REG          (DR_REG_RTC_I2C_BASE + 0x0050)
/* RTC_I2C_COMMAND6_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command6_done*/
#define RTC_I2C_COMMAND6_DONE  (BIT(31))
#define RTC_I2C_COMMAND6_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND6_DONE_V  0x1
#define RTC_I2C_COMMAND6_DONE_S  31
/* RTC_I2C_COMMAND6 : R/W ;bitpos:[13:0] ;default: 14'h1901 ; */
/*description: command6*/
#define RTC_I2C_COMMAND6  0x00003FFF
#define RTC_I2C_COMMAND6_M  ((RTC_I2C_COMMAND6_V)<<(RTC_I2C_COMMAND6_S))
#define RTC_I2C_COMMAND6_V  0x3FFF
#define RTC_I2C_COMMAND6_S  0

#define RTC_I2C_CMD7_REG          (DR_REG_RTC_I2C_BASE + 0x0054)
/* RTC_I2C_COMMAND7_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command7_done*/
#define RTC_I2C_COMMAND7_DONE  (BIT(31))
#define RTC_I2C_COMMAND7_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND7_DONE_V  0x1
#define RTC_I2C_COMMAND7_DONE_S  31
/* RTC_I2C_COMMAND7 : R/W ;bitpos:[13:0] ;default: 14'h0904 ; */
/*description: command7*/
#define RTC_I2C_COMMAND7  0x00003FFF
#define RTC_I2C_COMMAND7_M  ((RTC_I2C_COMMAND7_V)<<(RTC_I2C_COMMAND7_S))
#define RTC_I2C_COMMAND7_V  0x3FFF
#define RTC_I2C_COMMAND7_S  0

#define RTC_I2C_CMD8_REG          (DR_REG_RTC_I2C_BASE + 0x0058)
/* RTC_I2C_COMMAND8_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command8_done*/
#define RTC_I2C_COMMAND8_DONE  (BIT(31))
#define RTC_I2C_COMMAND8_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND8_DONE_V  0x1
#define RTC_I2C_COMMAND8_DONE_S  31
/* RTC_I2C_COMMAND8 : R/W ;bitpos:[13:0] ;default: 14'h1901 ; */
/*description: command8*/
#define RTC_I2C_COMMAND8  0x00003FFF
#define RTC_I2C_COMMAND8_M  ((RTC_I2C_COMMAND8_V)<<(RTC_I2C_COMMAND8_S))
#define RTC_I2C_COMMAND8_V  0x3FFF
#define RTC_I2C_COMMAND8_S  0

#define RTC_I2C_CMD9_REG          (DR_REG_RTC_I2C_BASE + 0x005c)
/* RTC_I2C_COMMAND9_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command9_done*/
#define RTC_I2C_COMMAND9_DONE  (BIT(31))
#define RTC_I2C_COMMAND9_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND9_DONE_V  0x1
#define RTC_I2C_COMMAND9_DONE_S  31
/* RTC_I2C_COMMAND9 : R/W ;bitpos:[13:0] ;default: 14'h0903 ; */
/*description: command9*/
#define RTC_I2C_COMMAND9  0x00003FFF
#define RTC_I2C_COMMAND9_M  ((RTC_I2C_COMMAND9_V)<<(RTC_I2C_COMMAND9_S))
#define RTC_I2C_COMMAND9_V  0x3FFF
#define RTC_I2C_COMMAND9_S  0

#define RTC_I2C_CMD10_REG          (DR_REG_RTC_I2C_BASE + 0x0060)
/* RTC_I2C_COMMAND10_DONE : RO ;bitpos:[31] ;default: 1'b0 ; */
/*description: command10_done*/
#define RTC_I2C_COMMAND10_DONE  (BIT(31))
#define RTC_I2C_COMMAND10_DONE_M  (BIT(31))
#define RTC_I2C_COMMAND10_DONE_V  0x1
#define RTC_I2C_COMMAND10_DONE_S  31
/* RTC_I2C_COMMAND10 : R/W ;bitpos:[13:0] ;default: 14'h0101 ; */
/*description: command10*/
#define RTC_I2C_COMMAND10  0x00003FFF
#define RTC_I2C_COMMAND10_M  ((RTC_I2C_COMMAND10_V)<<(RTC_I2C_COMMAND10_S))
#define RTC_I2C_COMMAND10_V  0x3FFF
#define RTC_I2C_COMMAND10_S  0

